In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\sandeep\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\sandeep\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sandeep\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\sandeep\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sandeep\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\sandeep\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

data=[1,2,3,4]

data1=pd.Series(data)

print(data1)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
data1={"name":"sandy","age":10,"gender":"Male"}

data=pd.Series(data1)
print(data)

name      sandy
age          10
gender     Male
dtype: object

In [4]:
data={
    "Name":["sandy","candy","randy"],
    "age":[10,20,30],
    "city":["Banglore","new york","florida"]
}

df=pd.DataFrame(data)
print(df)

    Name  age      city
0  sandy   10  Banglore
1  candy   20  new york
2  randy   30   florida

In [7]:
data=pd.read_csv("students_data.csv")
print(data["name"])

0     Aarav
1      Diya
2     Rohan
3     Sneha
4     Kiran
5     Meera
6     Arjun
7     Pooja
8     Rahul
9    Ananya
Name: name, dtype: object

In [8]:
data.head()

,student_id,name,age,gender,course,marks,attendance_percent,passed
0,101,Aarav,20,M,ML,85,90,True
1,102,Diya,21,F,DL,92,95,True
2,103,Rohan,19,M,ML,78,85,True
3,104,Sneha,22,F,Data Science,88,92,True
4,105,Kiran,23,M,DL,90,88,True

In [9]:
df.describe()

        age
count   3.0
mean   20.0
std    10.0
min    10.0
25%    15.0
50%    20.0
75%    25.0
max    30.0

In [10]:
df["double_age"]=df["age"].apply(lambda x:x*2)

print(df)

    Name  age      city  double_age
0  sandy   10  Banglore          20
1  candy   20  new york          40
2  randy   30   florida          60

In [13]:
def triple(data):
    return data*3
df["triple_age"]=df["age"].apply(triple)

print(df)

    Name  age      city  double_age  triple_age
0  sandy   10  Banglore          20          30
1  candy   20  new york          40          60
2  randy   30   florida          60          90